Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: **Programmer's note:** the :keyword:`global` is a directive to the parser. It applies only to code parsed at the same time as the :keyword:`global` statement. In particular, a :keyword:`global` statement contained in a string or code object supplied to the built-in :func:`exec` function does not affect the code block *containing* the function call, and code contained in such a string is unaffected by :keyword:`global` statements in the code containing the function call. The same applies to the :func:`eval` and :func:`compile` functions.
ru: **Замечание для программистов :** «:keyword:`global`» – это указание, предназначенное анализатору текста (парсеру) . Оно относится только к коду, обрабатываемому одновременно с этой инструкцией «:keyword:`global`» . В норме – инструкция «:keyword:`global`» , содержащаяся в строке или в объекте-коде, передаваемых во встроенную функцию «:func:`exec`» , не влияет на блок кода, в котором этот вызов функции содержится. И обратно, код, содержащийся в такого рода тексте, не испытывает действия инструкции «:keyword:`global`» , находящейся в коде, из которого сделан вызов этой функции с текстом. То же относится и к функциям «:func:`eval`» и «:func:`compile`» .

source: The :keyword:`nonlocal` statement
ru: Инструкция «:keyword:`nonlocal`»

source: The :keyword:`nonlocal` statement causes the listed identifiers to refer to previously bound variables in the nearest enclosing scope. This is important because the default behavior for binding is to search the local namespace first. The statement allows encapsulated code to rebind variables outside of the local scope besides the global (module) scope.
ru: Инструкция «:keyword:`nonlocal`» приводит к тому, что перечисленные в ней идентификаторы будут указывать на объекты, на которые они указывали в ближайшей внешней области имён. Это принципиально отличается от поведения связывания по-умолчанию, при котором сначала происходит поиск в локальной области имён. Эта инструкция позволяет изолированному (инкапсулированному) коду возвращать связывание переменных, существовавшее у них за пределами данной локальной области имён помимо того, что относится к глобальной (на уровне модуля) области имён.

source: Names listed in a :keyword:`nonlocal` statement, unlike to those listed in a :keyword:`global` statement, must refer to pre-existing bindings in an enclosing scope (the scope in which a new binding should be created cannot be determined unambiguously).
ru: Имена, перечисленные в инструкции «:keyword:`nonlocal`» , в отличие от тех, что перечислены в инструкции «:keyword:`global`» , обязаны указывать на уже́ существующие назначения в непосредственно объемлющей области имён (та область, в которой новые связывания могли бы быть созданы, не может быть установлена однозначно) .

source: Names listed in a :keyword:`nonlocal` statement must not collide with pre-existing bindings in the local scope.
ru: Среди имён, перечисленных в инструкции «:keyword:`nonlocal`» не должно быть тех, что уже́ существуют в этой локальной области имён.

source: The specification for the :keyword:`nonlocal` statement.
ru: Спецификация инструкции «:keyword:`nonlocal`» .
